Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/blind_persons_pension.html.txt.tmx
Source language: en
Languages: ga

source: The Blind Pension is a means-tested payment paid to blind and visually impaired people who are habitually resident in Ireland
ga: Íocaíocht le scrúdú maoine é Pinsean Daill a íoctar leis na daill agus le daoine atá faoi mhíchumas na súl a bhfuil gnáthchónaí in Éirinn orthu

source: The payment is made by the Department of Social Protection
ga: An Roinn Coimirce Sóisialaí a dhéanann an íocaíocht

source: To qualify for the Pension you must supply an eye test from an opthalmic surgeon to verify your visual impairment
ga: Le bheith i dteideal an phinsin ní mór scrúdú súl a fháil déanta ag lia oftailmeach (íocfaidh an Roinn as) ar mhaithe le míchumas na súl a chinntiú

source: The payment is made up of a personal rate for you and extra amounts for a qualified adult and any child dependants (see 'Rates' below)
ga: Tá an íocaíocht a gheobhaidh tú déanta suas de ráta pearsanta duit féin agus suimeanna eile do dhuine fásta cáilithe agus aon pháistí cleithiúnacha (breathnaigh na rátaí thíos)

source: If you are awarded a Blind Pension, you may also qualify for the Blind Welfare Allowance paid by the HSE
ga: Má fhaigheann tú Pinsean Daill d’fhéadfadh sé go mbeadh tú in ann Liúntas Leasa na nDall a fháil freisin

source: You will automatically get a Free Travel Pass and a Companion Free Travel Pass
ga: Gheobhaidh tú Pas Saor Thaistil agus Pas Saor Thaistil Chompánaigh

source: (A Free Travel Pass allows you to travel on State public transport in Ireland for free
ga: (Pas Saor Thaistil a thugann deis duit taisteal ar sheirbhísí iompair phoiblí an Stáit saor in aisce

source: A Companion Free Travel Pass allows your companion aged 16 or over to also travel for free)
ga: Tugann Pas Saor Thaistil Chompánaigh deis do chompánach atá 16 bliana nó ós a chionn taisteal in éineacht leat in aisce)

source: You may also qualify for other benefits such as the Living Alone Increase and the Household Benefits Package
ga: D'fhéadfadh sé freisin go mbeadh tú i dteideal liúntas eile, Liúntas Cónaithe i d'Aonair agus an Scéim Liúntas don Líon Tí

source: This provision is in effect from April 2015
ga: É Pinsean na nDall foinse inchánach ioncaim

source: If you are blind or have a serious visual impairment before reaching 18 years, you should make your claim 4 months before your 18th birthday
ga: Más duine dall thú nó má tá tú faoi mhíchumas dona amhairc roimh duit ocht mbliana déag a bhaint amach ba cheart duit éileamh a dhéanamh ar an bPinsean seo 4 mhí roimh d'ochtú breithlá déag

source: (If you are aged 16-18, you may qualify for Disability Allowance.) Blind Pension is not paid after you turn 66
ga: (Má tá tú idir 16-18, d'fhéadfadh sé go mbeadh tú in ann Liúntas Míchumais) a fháil.) Féadfaidh tú Pinsean na nDall a fháil go dtí go sroichfidh tú 66 bliana d’aois

source: If you become blind or seriously visually impaired after your 18th birthday, you should apply as soon as possible
ga: Más i ndiaidh duit ocht mbliana déag a bhaint amach a thagann daille nó míchumas amhairc ort, ba cheart duit iarratas a dhéanamh chomh luath agus a tharlaíonn sé

source: This is important as payment can only be made from the date your application is received
ga: Tá sé seo tábhachtach mar ní féidir íocaíocht a thabhairt ach ón lá a thagann an t-iarratas isteach

source: If you require full-time care, the person looking after you may qualify for a Carer's Allowance or Carer's Benefit
ga: Má theastaíonn cúram lánaimseartha uait d'fhéadfadh sé go mbeadh an cúramaí i dteideal ceann de na híocaíochtaí seo a leanas - Liúntas Cúramaí nó Sochar Cúramaí

source: The main items that are counted as means include:
ga: I measc na bpríomhnithe a chuirtear san áireamh mar mhaoin tá:

source: • Any cash income that you or your spouse, civil partner or cohabitant may have (including income from employment)
ga: • Aon ioncam airgid thirim atá agat nó ag do chéile/pháirtnéir sibhialta/chomhchónaitheoir

source: • The value of savings, investments, shares, land etc
ga: • Luach aon choigiltis, infheistíochtaí, scaireanna, talún, & rl

source: • Any property you may have
ga: • Aon áitreabh atá agat

source: • Maintenance paid to you if you are deserted, separated or a civil partner not living with the other civil partner
ga: • Íocaíocht chothabhála a fhaigheann tú má tá tú tréigthe, scartha nó páirtnéir sibhialta nach bhfuil ina c(h)ónaí leis an bpáirtnéir sibhialta eile

source: The following items are not counted as means for Blind Pension:
ga: Ní chuirtear na nithe seo san áireamh mar mhaoin:

source: • Any payment made by the Department of Social Protection
ga: • Íocaíocht ón Roinn seo atá dhá fháil ag ball eile den líon tí

source: • The value of the first €20,000 of capital assets (for example, savings)
ga: • Luach an chéad €20,000 de shócmhainní caipitiúla (mar shampla coigiltis)

source: • Money received from a recognised charitable organisation (excluding public or local authority)
ga: • Airgead a fuair tú ó eagraíocht aitheanta carthanachta (gan údarás poiblí nó áitiúil a bheith san áireamh)

source: • The maintenance part of a student grant from SUSI paid to you, a qualified adult or child dependant(s) for certain courses
ga: • An chuid chothabhála de dheontas ard aoideachais a íoctar ar do shon, ar son duine fhásta cháilithe nó ar son leanaí cleithiúnacha i leith cúrsaí faoi leith

source: • Income up to a certain limit from rehabilitative employment
ga: • Ioncam go huasteorainn faoi leith ón bhfostaíocht athshlánaithe

source: • Income from rehabilitative training
ga: • Ioncam ó thraenáil athshlánaithe

source: • Child Benefit, Supplementary Welfare Allowance or foster care allowances
ga: • Sochar Leanaí, Liúntas Breise Leasa ná liúntais i dtaobh leanaí atá faoi chúram altrama nó gaolta

source: • Mobility Allowance from the Department of Health
ga: • Liúntas Soghluaisteachta ón Roinn Sláinte

source: Work and Blind Pension
ga: • Liúntas Leasa na nDall

source: • €400 of your annual earnings
ga: Obair agus Pinsean Daill

source: • €133 of your annual earnings for each of your qualified children under age 18 (or under age 22 if in full time education). There are no disregards for your spouse, civil partner or cohabitant's earnings. Blind Pension and other payments
ga: Is féidir leat €120 sa tseachtain a shaothrú ón bhfostaíocht athshlánaithe roimh don ioncam sin a bheith curtha san áireamh don scrúdú maoine

source: • Widow’s, Widower’s or Surviving Civil Partner’s Contributory and Non-Contributory Pension
ga: Má bhíonn tú i bhfostaíocht athshlánaithe le tuarastal idir €120 agus €350 in aghaidh na seachtaine

source: If an increase is payable for a qualified spouse, civil partner or cohabitant and/or qualified children with your Blind Pension, an increase is also payable on the schemes listed above
ga: Má tá do thuillimh ó obair athshlánaithe os cionn €120 sa tseachtain, ní thógfar 50% ded' thuillimh idir €120 agus €350 san áireamh sa tástáil acmhainne don Pinsean na nDall

source: Blind Pension is payable while you are getting Partial Capacity Benefit. Partial Capacity Benefit is not taken into account in the means test for Blind Pension but your earnings are taken into account and may affect the amount of Blind Pension paid
ga: Má tá Pinsean na nDall agat measúnófar aon thuillimh os cionn €350 agus laghdófar do theidlíocht do Phinsean na nDall ar aon dul leis na rátaí laghdaithe íocaíochta cuí do Phinsean na nDall

source: │Blind Pension │Weekly rate │
ga: │Pinsean na │Rátaí i 2016 agus roimh 17 │Rátaí ó 17 Márta │

source: │Personal rate │188.00 │
ga: │Ráta pearsanta │188.00 │193.00 │

source: │Increase for a Qualified│124.80 │
ga: │Duine Fásta │124.80 │128.10 │

source: │Increase for a Qualified│29.80 (full rate) │
ga: │Cleithiúnach is│29.80 │29.80 │

source: │Increase for a Qualified│128.10 │
ga: Conas iarratas a dhéanamh

source: To apply fill in application form (BP1) (pdf)
ga: Is féidir foirm iarratais (BP1) do Phinsean na nDall a íoschóipeáil anseo (pdf)

source: A braille and audio cassette tape version of this application form is also available from the National Council for the Blind of Ireland
ga: Tá leagan i gcló braille agus ar chaiséad fuaime den fhoirm iarratais seo ar fáil freisin ó Chomhairle Náisiúnta do na Daill in Éirinn

source: This application form is also available from your Intreo Centre or Social Welfare Branch Office
ga: Tá an fhoirm iarratais seo ar fáil freisin ón oifig áitiúil leasa shóisialaigh

source: Staff in your Intreo Centre or Social Welfare Branch Office will be happy to help you to complete the form and can answer any questions you may have
ga: Beidh cúnamh ar fáil duit ón bhfoireann san oifig áitiúil leasa shóisialaigh leis an bhfoirm seo a chomhlánú agus is féidir leo aon cheisteanna atá agat a fhreagairt

source: When you apply for Blind Pension you may need to send the Department certificates if the birth(s), marriage, civil partnership or civil union took place outside the Republic of Ireland
ga: Agus iarratas á dhéanamh agat ar Phinsean na nDall, is féidir go gcaithfidh tú teastais mar iad seo a leanas a chur chugainn má tharla an bhreith (na breitheanna), an pósadh, an pháirtnéireacht shibhialta nó an t-aontas sibhialta lasmuigh de Phoblacht na hÉireann

source: If you are unhappy with a decision made about your claim for Blind Pension, you can appeal against it
ga: Achomharc a dhéanamh maidir le d'éileamh

source: You must always tell the Department of Social Protection if there are any changes to your circumstances while you are getting a Blind Pension
ga: Má tá tú míshásta le cinneadh a bhaineann le d'éileamh ar Phinsean na nDall is féidir leat achomharc a dhéanamh

source: If your means or circumstances change you may no longer qualify for the payment or it may be reduced
ga: Léigh tuilleadh maidir le córas achomhairc leasa shóisialaigh anseo

source: Department of Social Protection
ga: An Roinn Coimirce Sóisialaí

source: Opening Hours:This office does not offer a service to personal callers
ga: Uaireanta Oscailte:Ní thairgeann an oifig seo seirbhís do chuairteoirí pearsanta

source: All queries must be made using the online enquiry form, by telephone or in writing
ga: Caithfidh gach ceist a bheith cur isteach tríd an fhoirm fiosraithe ar líne a úsáid, tríd an teileafón nó i scríbhinn

source: You can email the Blind Pension section using the secure enquiry form
ga: Is féidir leat ríomhphost don Rannóg Pinsean na nDall a sheoladh tríd an fhoirm fhiosraithe daingnithe a úsáid
